package JavaStudy.Array;


/*
描述：
    验证给定数列是否为等差数列（连续两项的差值恒定）
任务：
    输入整数数组arr，输出arr是否为等差数列。
示例：
[3,5,7,9] → true  
[10,7,4,2] → false（第四项应为1）
*/


/*
描述:
    斐波那契数列
任务:
    输入n，计算并输出斐波那契数列的第n项。(ai = ai-1 + ai-2, i = 3, 4, 5,...)

示例:
1 → 1
2 → 1 1
5 → 1 1 2 3 5
*/


/*
描述:
    你电最近天天被水淹没，给定了一个数组，记录了未来 n 天的降雨量，
    电击小子认为，如果这天降雨量超过 m ，那么他就不回去学校，
                如果连续三天降雨量超过 m，他就再也不去你电了。
任务:
    输出电击小子一共多少天不去学校。
*/


/*
描述：
    验证数组是否可以通过 <循环移位> 
    (所有数往右或者往左移动一格，边缘元素补到前面)
    (例如: 1 2 3 4 5 -> 向右一位 5 1 2 3 4)
    成为严格递增序列(ai+1 > ai)
示例：
    [4,7,6,1,2] → false（4 7 6无论怎么移动都无法做到严格递增）
    [3,4,5,1,2] → true（移位2次后成1,2,3,4,5）
    要求时间复杂度不超过O(n)
*/


/*
描述:
    矩阵运算
任务:
    给定一个n * m 的矩阵。
    完成矩阵的加 减 乘 转置 逆 运算
*/