package JavaStudy.Strin;

public class Task {

    public static void main(String[] args) {

    }
}

/*
 * 描述:
 * 将含有逗号分隔的字符串分割后重组为特定格式。
 * 任务:
 * 输入字符串 str 按逗号分隔，并将其重组为特定格式。
 * (如 "a,b,c" → "[a][b][c]")。
 */

/*
 * 描述:
 * 反转字符串中的每个单词，并拼接结果。
 * 任务:
 * 将字符串 s 按空格分割，每个单词反转后重新拼接,
 * (如 "hello world" → "olleh dlrow")。
 */

/*
 * 描述:
 * 你电特别睿智，路径总是写不对 ，一会带/ 一会不带
 * 将多个路径片段用 / 拼接，避免重复分隔符（如 "/usr", "bin", "/java" → "/usr/bin/java"）。
 * 任务:
 * 确保拼接后的路径无重复 /。
 */

/*
 * 描述:
 * 你电喜欢做填空题不喜欢做简答题，填答案可真是他的最爱。
 * 将模板中的占位符 {{key}} 替换为实际值
 * (传入 String[] key = {Alice})
 * (如 "Hello, {{key}}!" → "Hello, Alice!")。
 * 任务:
 * 替换所有占位符。
 */

/*
 * 描述:
 * 你电认为 数字 , 字母 是不一样的
 * 他用()包括所有数字，[]包括所有字母
 * 然后还要用#分割所有的数字，@分割所有的字母
 * 最后他想用||把这两者分开,用<>把这二者全部包起来
 * (如 "123abc?" → "<(1#2#3)||[a@b@c]>"）。
 * 任务:
 * 是的你电不会写，要你帮他
 */