package JavaStudy.DataType;

public class Task {
    
}
/*
描述：
    尼电 刚学完int类型，立即兴高采烈的去做了一道算法题，却发现
    测试数据高达10^15，int类型显然溢出，他想知道有没有其他的数据类型可以容纳下这个数字，
任务:
    找到可以容纳上述数字的数据类型。(out.println()告诉我)
*/


/*
描述:
    你电总是记不住各种数据类型的数据范围和占用字节数，让你帮他写个函数
任务:
    写一个函数，返回int float double long等数据类型所能容纳的最大整数值。以及占用的字节数
*/


/*
描述:
    字面量规范，你电喜欢数数，害怕装不下，想问你下面的用什么装
任务:
    写出正确的字面量赋值：
    - 10亿
    - 10位圆周率
    - Abondance
    - 二进制的1111111(找到最适合的)
*/


/*
描述:
    数值溢出实验，你电没有电脑，但是他超想知道int类型溢出后到底会输出什么样的值。
    所以他让你帮他写写
任务:
    计算Byte.MAX_VALUE + 1 和 
    Short.MIN_VALUE - 1的输出结果
*/

/*
描述:
    类型自动提升，是的计算机会偷偷给你把类型提上去
任务:
    计算表达式：5 / 2 + 5.0 / 2 
    并解释结果差异
*/